# execution_tab.py
from Tabs.csc_tab_base import CSCTabBase

class ExecutionTab(CSCTabBase):
    TITLE = "임무 계획·실행 CSC"
    
    # **EB → Push**
    PUSH_MESSAGES = [
        ("0601", "임무이행요청"),
        ("0602", "임무취소"),
        ("0904", "행동트리 서비스 제공 요청"),
    ]
    
    # **BE → Receive**
    RECEIVE_MESSAGES = [
        ("0101", "시스템운용모드"),
        ("0201", "협업기저임무 계획"),
        ("0202", "선행임무정보"),
        ("0203", "비행참조정보"),
        ("0301", "임무계획"),
        ("0302", "개별임무계획"),
        ("0303", "무인기 비행계획"),
        ("0304", "유인기 비행계획"),
        ("0401", "유무인기 상태정보"),
        ("0402", "전장상황인지정보"),
        ("0501", "임무수행상태정보"),
        ("0805", "임무종료 명령"),
        ("0806", "SW종료 명령"),
    ]
