# decision_support_tab.py
from Tabs.csc_tab_base import CSCTabBase

class DecisionSupportTab(CSCTabBase):
    TITLE = "의사결정 지원 CSC"
    
    # **FB → Push**
    PUSH_MESSAGES = [
        ("0102", "운용모드 설정"),
        ("0701", "옵션정보 전송"),
    ]
    
    # **BF → Receive**
    RECEIVE_MESSAGES = [
        ("0101", "시스템운용모드"),
        ("0201", "협업기저임무 계획"),
        ("0202", "선행임무정보"),
        ("0203", "비행참조정보"),
        ("0301", "임무계획"),
        ("0302", "개별임무계획"),
        ("0303", "무인기 비행계획"),
        ("0304", "유인기 비행계획"),
        ("0401", "유무인기 상태정보"),
        ("0402", "전장상황인지정보"),
        ("0501", "임무수행상태정보"),
        ("0701", "의사결정 옵션정보"),
        ("0806", "SW종료 명령"),
        ("0901", "옵션정보 생성 요청"),
    ]
