# manage_info_tab.py
from Tabs.csc_tab_base import CSCTabBase

class ManageInfo(CSCTabBase):
    TITLE = "정보 관리 CSC"
    PUSH_MESSAGES = [
        ("0101", "시스템 운용 모드"),
        ("0201", "입력 임무 계획"),
        ("0202", "선행 임무 정보"),
        ("0203", "비행 참조 정보"),
        ("0301", "임무 계획"),
        ("0302", "개별 임무 계획"),
        ("0303", "무인기 비행 계획"),
        ("0304", "LAH 비행 계획"),
        ("0401", "LAH 상태"),
        ("0402", "상황 인식 정보"),
        ("0501", "임무 상태 정보"),
        ("0701", "옵션 정보 전송"),
        ("0702", "임무 진행"),
        ("0801", "재계획 명령"),
        ("0802", "강제명령"),
        ("0803", "다음 협업기저임무 수행 명령"),
        ("0805", "운용 이벤트"),
        ("0806", "시스템 부팅 명령"),
        ("0903", "수행임무갱신요청"),
    ]
    RECEIVE_MESSAGES = []
