# manage_info_tab.py
from Tabs.csc_tab_base import CSCTabBase

class MissionMonitoringTab(CSCTabBase):
    TITLE = "정보 관리 CSC"
    PUSH_MESSAGES = (
        ("0102", "운용모드 설정"),
        ("0501", "임무수행상태정보"),
        ("0502", "임무지표정보"),
        ("0503", "협업임무종료통보"),
        ("0902", "재계획 요청"),
    )

    RECEIVE_MESSAGES = (
        ("0101", "시스템 운용모드"),
        ("0201", "협업기저임무 계획"),
        ("0202", "선행임무정보"),
        ("0203", "비행참조정보"),
        ("0301", "임무계획"),
        ("0302", "개별임무계획"),
        ("0303", "무인기 비행계획"),
        ("0304", "유인기 비행계획"),
        ("0401", "유무인기 상태정보"),
        ("0402", "전장상황인지정보"),
        ("0601", "기저행위"),
        ("0702", "임무 진행"),
        ("0801", "재계획 명령"),
        ("0802", "강제명령"),
        ("0803", "다음 협업기저임무 수행 명령"),
        ("0805", "운용 이벤트"),
        ("0806", "SW종료 명령"),
        ("0903", "수행임무갱신요청"), 
    )


